Repository: r7-labs/R7.MiniGallery
Catalog: R7.MiniGallery/App_LocalResources/EditMiniGallery.ascx.*.resx
Languages: ru_ru

# ModuleHelp.Text
source: <p>A R7.MiniGallery module</p>
ru_ru: <p>Модуль R7.MiniGallery</p>

# ControlTitle_edit.Text
source: Edit Image
ru_ru: Редактировать изображение

# ConfirmDelete.Text
source: Do you really want to delete this image?
ru_ru: Уверены, что хотите удалить это изображение?

# labelAlt.Text
source: Alt
ru_ru: Альт. описание

# labelAlt.Help
source: Provide an alternate description for the image, which could be used by a browser instead of it.
ru_ru: Введите краткое альтернативное описание изображения, которое может быть показано браузером вместо изображения. Если не указано, модуль попытается использовать заголовок изображения в качестве альтернативного описания.

# labelTitle.Text
source: Title
ru_ru: Заголовок

# labelTitle.Help
source: Provide title for the image.
ru_ru: Введите заголовок изображения, который будет отображаться рядом с изображением, а также может использоваться в качестве альтернатиного описания, если последнее не задано явно.

# labelImage.Text
source: Image
ru_ru: Изображение

# labelImage.Help
source: An image to add to the gallery.
ru_ru: Изображение для добавления в галерею.

# labelLink.Text
source: Link
ru_ru: Ссылка

# labelLink.Help
source: Link to a resource to open then image is clicked.
ru_ru: Ссылка на ресурс, открываемый при нажатии на изображение.

# labelSortIndex.Text
source: Sort Index
ru_ru: Индекс сортировки

# labelSortIndex.Help
source: Sort index value.
ru_ru: Значение индекса сортировки.

# labelStartDate.Text
source: Start Publication:
ru_ru: Начало публикации:

# labelStartDate.Help
source: Enter the date from current image should be published on the site.
ru_ru: Введите дату, начиная с которой изображение должно быть опубликовано на сайте.

# labelEndDate.Text
source: End Publication:
ru_ru: Окончание публикации:

# labelEndDate.Help
source: Enter the date from current image should be removed from publication on the site.
ru_ru: Введите дату, при наступлении которой изображение должно быть снято с публикации на сайте.
