Repository: r7-labs/R7.MiniGallery
Catalog: R7.MiniGallery/App_LocalResources/Settings.*.resx
Languages: ru_ru

# ControlTitle_settings.Text
source: R7.MiniGallery Settings
ru_ru: Настройки R7.MiniGallery

# ModuleHelp.Text
source: About R7.MiniGallery Settings
ru_ru: О настройках R7.MiniGallery

# StyleSet.Text
source: Style Set
ru_ru: Набор стилей

# StyleSet.Help
source: Style set name for the gallery elements
ru_ru: Имя набора стилей элементов галереи

# MaxHeight.Text
source: List Height
ru_ru: Высота списка

# MaxHeight.Help
source: Maximum height of a image list in CSS units, used to make scrollbars visible (leave empty to disable).
ru_ru: Максимальная высота списка изображений в единицах CSS. Используется для включения вертикальной полосы (оставьте пустым, чтобы отключить).

# Target.Text
source: Target
ru_ru: Цель ссылки

# Target.Help
source: Set link target. Enter window or frame name for custom target or leave empty for no target. Has no meaning if jQuery lightbox is used, but may be useful without it.
ru_ru: Устанавливает цель для ссылки. Введите имя окна или фрейма, либо оставьте поле пустым для отключения ссылки. Значение не имеет смысла в случае, если используется модуль Lightbox, но может быть полезно без него.

# UseLightbox.Text
source: Use Lightbox
ru_ru: Использовать Lightbox

# UseLightbox.Help
source: Check to use Lightbox-like viewer or image gallery jQuery module.
ru_ru: Отметьте, чтобы использовать модуль просмотрщика изображений или галереи jQuery по типу Lightbox.

# UseScrollbar.Text
source: Use jQuery Scrollbar
ru_ru: Полоса прокрутки jQuery

# UseScrollbar.Help
source: Check to use jQuery scrollbar module.
ru_ru: Отметьте, чтобы использовать модуль полосы прокрутки jQuery.

# UseImageHandler.Text
source: Use Image Handler
ru_ru: Использовать генератор миниатюр

# UseImageHandler.Help
source: Check to use external image handler to create thumbnails (only R7.ImageHandler is supported at this time).
ru_ru: Отметьте, чтобы использовать внешний генератор миниатюр (в настоящее время поддерживается только R7.ImageHandler).

# ImageHandlerParams.Text
source: Image Handler Params
ru_ru: Параметры генератора миниатюр

# ImageHandlerParams.Help
source: Add URL parameter string which will be added to image handler URL if name=value pairs format, or leave empty to use default URL. Currently supported tags: {fileticket}, {fileid}, {width}, {height}.
ru_ru: Добавьте строку параметров URL для дополнения URL генератора миниатюр в формате имя=значение, или оставьте пустым для использования параметров по умолчанию. Поддерживаются метки: {fileticket}, {fileid}, {width}, {height}.

# ShowTitles.Text
source: Show Titles
ru_ru: Показывать заголовки

# ShowTitles.Help
source: If checked, images title is displayed
ru_ru: Отметьте, чтобы отобразить заголовки изображений.

# Expand.Text
source: Expand Columns
ru_ru: Расширить колонки

# Expand.Help
source: If checked, each column width are calculated as 100% / number of columns approximately. This setting only effective if a columns number is specified explicitly (not auto).
ru_ru: Если отмечено, ширина каждой колонки будет расчитана примерно как 100% / количество колонок. Эта настройка работает только в том случае, если количество колонок указано явно (не авто).

# Header.Text
source: Header
ru_ru: Заголовок

# Header.Help
source: Enter HTML to be placed before (above) image list. This setting could replace Header value from Module Settings / Advanced tab.
ru_ru: Введите код HTML для размещения перед (выше) списка изображений. Эта настройка может заменять значение Заголовка модуля на вкладке Настройки модуля / Расширенные.

# Footer.Text
source: Footer
ru_ru: Подвал

# Footer.Help
source: Enter HTML to be placed after (below) image list. This setting could replace Footer value from Module Settings / Advanced tab.
ru_ru: Введите код HTML для размещения после (ниже) списка изображений. Эта настройка может заменять значение Подвала модуля на вкладке Настройки модуля / Расширенные.

# sectionBaseSettings.Text
source: R7.MiniGallery Settings
ru_ru: Настройки R7.MiniGallery

# HeaderAndFooter.Section
source: Header & Footer
ru_ru: Заголовок и подвал

# ImageHandler.Section
source: Image Handler Settings
ru_ru: Настройки генератора миниатюр

# Columns.Text
source: Columns
ru_ru: Число колонок

# Columns.Help
source: Set number of columns in the image list. If value set to 0, all available width will be taken by images.
ru_ru: Устанавливает количество колонок в списке изображений. Если установлено значение 0, изображения будут пытаться занять все доступное пространство.

# ImageWidth.Text
source: Image Width
ru_ru: Ширина изображения

# ImageWidth.Help
source: Specify width of the displayed image in any CSS units. If not set, thumbnail width or original image width will be used.
ru_ru: Укажите ширину изображения в любых единицах CSS. Если это значение не задано, будет использоваться ширина миниатюры или исходного изображения.

# ImageHeight.Text
source: Image Height
ru_ru: Высота изображения

# ImageHeight.Help
source: Specify height of the displayed image in any CSS units. If not set, thumbnail height or original image height will be used.
ru_ru: Укажите высоту изображения в любых единицах CSS. Если это значение не задано, будет использоваться высота миниатюры или исходного изображения.

# ThumbWidth.Text
source: Thumb Width (px)
ru_ru: Ширина миниатюры (px)

# ThumbWidth.Help
source: Specify thumbnail image width in px or leave empty.
ru_ru: Укажите ширину миниатюры в пикселах или оставьте поле пустым.

# ThumbHeight.Text
source: Thumb Height (px)
ru_ru: Высота миниатюры (px)

# ThumbHeight.Help
source: Specify thumbnail image width in pixels or leave empty.
ru_ru: Укажите высоту миниатюры в пикселах или оставьте поле пустым.

# NumberOfRecords.Text
source: Show Records
ru_ru: Отображать записей

# NumberOfRecords.Help
source: Enter the number of records to show or leave empty to show it all.
ru_ru: Укажите количество отображаемых элементов списка или оставьте поле пустым, чтобы показать все изображения.

# SortOrder.Text
source: Sort Ascending
ru_ru: По возрастанию

# SortOrder.Help
source: Check if image list should be sorted by SortIndex ascending.
ru_ru: Отметьте, если элементы списка изображение должны быть отсортированы по возрастанию значения поля Индекс сортировки.

# Auto.Text
source: 0 (auto)
ru_ru: 0 (авто)

# Default.Text
source: Default
ru_ru: По умолчанию

# TargetCustom.Text
source: <Custom>
ru_ru: <Другая>

# TargetNone.Text
source: <None>
ru_ru: <Нет>

# LightboxType.Text
source: Lightbox Type
ru_ru: Использовать Lightbox

# LightboxType.Help
source: Select the lightbox module to use.
ru_ru: Выберите тип используемого модуля Lightbox.

# LightboxType.None
source: <None>
ru_ru: <Нет>

# LightboxType.Default
source: <Default>
ru_ru: <По-умолчанию>
